"""
알고리즘:어떤 문제를 해결하는 논리적인 과정
자료구조:자료구조:데이터를 어떻게 하면 효율적으로 관리할 수 있는가

알고리즘 표현법:의사코드, 일반언어, 순서도, 프로그램 코드, 혼합 형태
1.의사코드:프로그램 언어와 비슷하게 작성하지만 프로그램 언어는 아닌 방식
2.일반 언어:자연어로 표현하는 방식
3.프로그램 코드:프로그래밍 언어로 바로 작성하는 방식, 주로 간단한 알고리즘
4.순서도:여러종류의 상자와 화살표를 이용해서 표현한 방식
5.혼합형태: 여러가지 알고리즘 표현을 종합적으로 활용한 방식, 주로 복잡한 알고리즘

자료구조의 종류
1.단순 자료구조:
-자료의 속성을 말함
-실수(float), 문자열(character), 정수(integer)
2.선형 자료구조:
-자료의 구조를 말함
-리스트, 스택, 큐
3.비선형 자료구조:
-자료의 구조를 말함
-트리, 그래프
4.파일 자료구조:
-자료의 속성을 말함

시간복잡도
좋은 알고리즘은 같은 데이터 개수에서 연산수가 적고, 시간이 적게 걸린다.

선형리스트:데이터를 일정한 순서로 나열한 자료구조이다.
선형리스트는 데이터의 실제 위치 순서로 구성된다.(저장장치에 순서대로 저장된다, 그러므로 각 위치도 4씩 증가한다.)

선형리스트의 단점:
선형리스트를 수정하려면 뒤의 데이터를 움직여야 해서, 데이터가 많을때 시간이 오래걸린다는 문제가 있댜. 이를 오버헤드라고 부른다.

선형리스트 데이터 삽입: 데이터가 0번, 1번, 2번, 3번이 순서대로 있을떄, 2번과 3번 사이에 데이터(new)를 삽입하려 한다면,
2번과 3번 사이에는 빈칸이 없으므로 빈칸을 만들어서 리스트맨 마지막에 추가하고 3번, 4번를 한칸씩 오른쪽으로 밀면 2번과 3번 사이에 미나가 들어갈 수있다.

선형리스트 중간 데이터 삽입
1.선형 리스트에 빈칸을 추가한다.
2.마지막 자리(방금 만든 빈칸)에 바로 앞자리(왼쪽,4번)를 넣고 원래 4번자리는 빈칸으로 만든다. 
3.4번에 3번을 넣고 3번을 빈칸으로 만든다.
4.지정위치(2번)에 있던 데이터가 다음칸으로 이동할 때 까지 3단계를 반복한다.(지정위치(2번)에 빈칸이 생길떄 까지)
3.지정위치(2번)에 빈칸이 생기면 데이터를 추가한다.

선형리스트 맨 끝 데이터 삽입
1.선형리스트에 빈칸을 추가한다.
2.지정위치(6번, 배열의 맨 마직막 위치)에 데이터를 추가한다.

선형리스트 데이터 삭제:
1.지정위치(1번)의 데이터를 삭제한다.
2.지정위치의 다음(2번 자리)에 있는 데이터를 지정위치(1번자리)로 이동하고  2번을 빈칸으로 만든다.
3.2번위치에 3번을 넣고 3번을 빈칸으로 만든다. 배열의 맨 마지막 위치가 앞칸으로 이동할 떄까지 2단계를 반복 한 후 멈춘다.
4.맨 마지막 빈칸을 제거한다.

선형리스트 맨 마지막 데이터 삭제:
1. 지정위치(3번)의 데이터를 삭제한다.
2. 지정위치(3번,배열의 맨 마지막 위치)를 완전히 제거한다.

단순 연결리스트: 순서가 링크로 나열된 자료구조
단순 연결리스트는 각 노드의 실제 주소는 물리적으로 떨어져 있지만, 링크로 연결되어있어 순서가 있다.

노드 구조:
다음 데이터(노드)를 가르키는 주소(링크)와 데이터로 이루어짐
단순연결리스트에서는 첫번째 노드를 가르키는 head를 쓴다.
리스트가 한 방향으로만 진행되어 다음 노드로는 찾아 갈 수 있고, 이전노드로는 돌아갈 수 없지만, head를 쓰면 돌아갈 수 있다.(처음노드부터 다시시작 시키는것임)

단순 연결리스트 노드 삽입:
새 노드를 중간에 추가하려면, 노드를 생성하고, 새노드가 추가하려는 위치 뒤에 노드에 주소를 복사하고 뒤에 노드가 추가되는 노드를 가르키면 된다.

단순 연결리스트 노드 삭제:
중간에 노드를 삭제하려면, 삭제하려는 노드의 뒷 노드가 삭제하려는 노드의 앞 노드의 주소를 가지고, 삭제하려는 노드를 삭제하면 된다.

데이터가 5개인 단순 연결리스트 생성:
1.첫번째 노드를 현재 노드로 지정하고, 현재 노드의 데이터인 다현을 출력한다.
2.첫번째 노드가 비어있지 않다면, 현재 노드의 링크가 가르키는 노드로 변경한 후 현재 노드이 데이터인 1번을 출력한다(0번부터 셈)
3. 링크가 비어있는 노드를 만날때까지 2단계를 반복하다가 링크가 빈 노드를 만나면 종료한다

단순 연결리스트의 일반 형태:
head(헤드)는 첫번째 노드를 가르키고, current(현재)는 현재 처리중인 노드를 가르키고, pre(이전)는 현재 처리중인 노드의 바로 앞 노드를 가르킨다.

배열에 저장된 데이터 입력 과정:
<첫번째 데이터>
1.빈 노드를생성
2. 사용자가 키보드로 첫번째 데이터를 입력하거나 제이터 저장소에서 데이터를 가져와 대입
3.완성된 노드를 메모리 공간에 넣음, 첫번째 노드를 head로 지정
<두번째 이후 데이터>
두번째 이후 데이터는 새 노드를 기존 노드에 저장하기 전에 기존 노드를 잠시 저장한 후 생성 해야 한다,
1.기존 노드를 임시저장(pre에)
2.빈 노드 생성
3.데이터 입력(또는 가져오기)
4.이전(pre)의 링크를 노드에 대입

첫번째 노드 삽입:
1.새 노드 생성
2.새 노드의 링크를 head노드가 가르키는 노드로 지정
3.헤드 노드를 새 노드로 지정

중간 노드 삽입:
1.head에서 시작해서 current노드가 사나인지 확인한다.
2.현재 노드를 이전(pre)노드로 저장하고, 현재 노드를 다음 노드로 이동한다. 그리고 현재 노드가 사나인지 롹인한다
3.현재 노드가 사나일떄까지 2단계를 반복한다.
4.현재 노드가 사나라면 우선 새 노드(솔라)를 새성한 후 새 노드의 링크를 현재 노드로 지정한다.
5.이전 노드의 링크를 새 노드로 지정한다.

마지막 노드 삽입:
문별노드를 마지막으로 삽입하는 과정을 알아보자. 존재하지 않는 데이터(예:재남)앞에 문별노드 삽입을 시도한다면 끝까지 데이터(재남)를 찾지 못하게된다. 결국 마지막 노드에 문별을 삽입한다.
1. 1~3은 중간노드 과정과 동일함. 없는 데이터인 재남을 찾는다.
4.만약 마지막까지 재남을 찾지 못했다면 새노드(문별노드)를 생성한 후 현재(current)노드의 링크를 새노드로 지정한다.

첫번째 노드 삭제:
1.현재 노드(current)를 삭제할 노드인 헤드(head)와 동일하게 만든다.
2.헤드를 삭제할 노드(다현노드)의 링크가 가리키던 정연노드로 변경한다.
3.현재 노드를 메모리에서 제거한다.

첫번째 외 노드 삭제:
1.헤드(head)에서 시작해서 현재 노드(current)가 쯔위인지 확인한다.
2.현재 노드(current)를 이전 노드(pre)로 저장하고,현재 노드를다음 노드로 이동한다. 그리고 현재 노드가 쯔위인지 확인한다.
3.현재 노드가 쯔위일떄까지 2단계를 반복한다.
4.현재 노드가 쯔위라면, 이전 노드의 링크를 현재 노드의 링크로 저장한다.
5.현재 노드를 메모리에서 삭제한다.

노드 검색:
1.현재 노드(current)를 첫번째 노드인 head와 동일하게 마들고, 현재 노드가 검색할 데이터인지 비교한다.검색할 데이터와 동일하다면 현재 노드를 반환한다.
2.현재노드를 다음 노드로 이동하고, 검색할 노드와 동일하다면 현재 노드를 반환한다.
3.앞의 2단계를끝까지 진행하고, 검색할 데이터를 찾지 못했다면 None을 반환한다.

원형 연결 리스트의 개념
단순 연결리스트는 배열에 데이터를 차례대로 저장하므로 데이터의 실제 위치순서로 데이터가 구성된다. 그리고 시작부터끝까지 차례대로 방문할 수 있다. 하지만, 끝까지 방문한 후에는 더이상 방문할 곳이 없어 종료되므로, head로 재시작 해야한다.
원형연결 리스트는 단순 연결리스트의 마지막 노드가 첫번째 노드로 연결되어있어 재시작하지 않아도 된다.
원형 연결리스트의 장점:단순연결리스트와 동일하게 데이터 삽입에서 오버헤드가 발생하지 않는다 
원형연결 리스트와 단순연결리스트의 공통점:
-첫번째 노드를 가르키는 헤드를 사용함
-노드삽입(노드를 생성 후 순서에 맞게 링크 수정함)
-노드삭제(노드의 링크를 뒤의 링크를 삭제하려는 노드 앞의 노드에 연결시키고 삭제함)
-노드 구조
원형연결 리스트와 단순연결리스트의 차이점:

노드생성:
노드 데이터형을 생성한ㄴ다. 그 다음 첫번째 다현 노드를 생성하면 a와 같은 첫번째노드가 생성된다.그런데 원형연결리스트느 첫번째 노드와 마지막 노드가 연결되는 구조를 가져야 한다. 노드가 1개뿐이므로 자기자신과 연결되도록 설정하면 b와같은 형태가 된다.

노드연결:
노드를 생성한 후 노드의 링크에 두번째 노드를연결하고 두번째 노드의 링크에는 첫번째 노드를 연결해서 원형구조를 갖게 하면 된다.

데이터가 5개인 원형 연결리스트 생성:

노드 삽입, 노드 삭제는 단순연결리스트와 동일
데이터 입력과정:
<첫번째 데이터>
1.빈 노드 생성
2. 데이터 입력
3.첫번째 노드를 헤드로 지정
4.새 노드의 링크를 헤드가 가리키는 노드로 지정(첫번째 노드이므로 자기자신)
5.노드를 메모리에 넣음
<두번째 이후 데이터>
1.기존 노드를 임시 저장
2.빈 노드 생성
3.데이터 입력
4.이전노드(pre)의 링크를 새 노드에 대입
5.새 노드의 링크에 헤드가 가리키는 노드 연결
6.노드를 메모리에 넣음

첫번째 노드 삽입
1.새 노드(화사노드)를 생성한다.
2.새 노드의 링크로 헤드가 가리키느 노드를 지정한다.
3.헤드가 가리키는 노드에서 시작해서 last를 다시 다음 노드로 변경하며 마지막 노트를 찾는다.
4.마지막 노드의 링크에 새 노드를 지정한다.
5.헤드 노드를 새 노드(화사)로 지정한다.

중간 노드 삽입
1.헤드에서 시작해서 현재 노드가 사나인지 확인한다.
2.현재 노드를 이전(pre)노드로 지정하고, 현재 노드를 다음 노드로 이동한다. 그리고 현재 노드가 사나인지 확인한다.
3.현재 노드가 사나일떄까지 2단계를 반복한다.
4.현재 노드가 사나라면 우선 새 노드(솔라노드)를 생성 한 후 이전 노드의 링크를 새 노드의 링크로 지정한다.
5.이전 노드(pre)의 링크를 새 노드로 지정한다.
마지막 노드 삽입
1.1~3은 중간 노드 삽입과정과 동일하므로 없는 데이터인 재남ㅁ을 찾는다.
4.마지막 노드까지 재남을 찾지 못했다면 우선 새 노드(문별노드)를 생성한 후 현재(current)노드의 링크를 새 노드로 지정한다.
5.새 노드의 링크를 헤드가 가리키는 노드로 지정한다.

첫 노드 삭제:
1.현재 노드를 삭제할 노드인 head와 동일하게 만든다.
2.헤드를 삭제할 노드(다현노드)의 링크가 가리키던 정연노드로 변경된다.
3.현재 노드를 메모리에서 제거한다.
첫번째 외 노드 삭제:
1.헤드(head)에서 시작해서 현재 노드가(current) 쯔위인지 확인한다.
2.현재 노드(current)를 이전 노드(pre)로 저장하고 현재 노드를 다음 노드로 이동한다. 현재 노드가 쯔위인지 확인한다.
3.현재 노드가 쯔위일때까지 2단계를 반복한다
4.현재 노드가 쯔위라면 이전 노드의 링크르 현재 노드의 링크로 저장한다.
현재 노드를 메모리에서 삭제한다.

노드검색
1.현재 노드를 첫번째 노드인 헤드와 동일하게 만들고, 현재 노드가 검색한 데이터인지 비교한다. 검색할 데이터와 동일하다면 현재 노드를 반환한다
2.현재 노드를 다음 노드로 이동하고, 검색할 데이터와 동일하다면 현재 노드를 반환한다.
3.2단계를 끝까지 진행하고, 검색할 데이터를 찾지 못했다면 None을 반환한다.


!!중요!!
노드를 생성할때도 시험에 나온다고 하심 꼭 과정을 기억할것
"""